# loc
- DataFrame.loc[inclusive,inclusive]   
(Access a group of rows and columns by labels(s)).
- Syntex  
dataframe.loc[Row(s) i want,Column(s) i want]

# iloc
- DataFrame.iloc[First inclusive,Last Execulive]    
(Access a group of rows and columns by integer position(s)).

In [1]:
import pandas as pd
dict={'Name':['Jame','Robert','Alen','Smith','Katharine','Liam','J Martin'], 
     'Marks':[98,89,99,87,90,83,82], 
     'Grades':['AA','AB','AA','AB','AC','BA','BB']}
df=pd.DataFrame(dict)
df

        Name  Marks Grades
0       Jame     98     AA
1     Robert     89     AB
2       Alen     99     AA
3      Smith     87     AB
4  Katharine     90     AC
5       Liam     83     BA
6   J Martin     82     BB

In [2]:
# first row and all columns
df.loc[0,:]

Name      Jame
Marks       98
Grades      AA
Name: 0, dtype: object

In [4]:
## row 0 to 2 and all columns
df.loc[[0,1,2],:]

     Name  Marks Grades
0    Jame     98     AA
1  Robert     89     AB
2    Alen     99     AA

In [5]:
## similar with above
df.loc[0:2,:]

     Name  Marks Grades
0    Jame     98     AA
1  Robert     89     AB
2    Alen     99     AA

In [6]:
#all the row of Name columns (in loc can use label and index position for column)
df.loc[:,'Name']

0         Jame
1       Robert
2         Alen
3        Smith
4    Katharine
5         Liam
6     J Martin
Name: Name, dtype: object

In [8]:
# all the rows of Name and Marks column
df.loc[:,['Name','Marks']]

        Name  Marks
0       Jame     98
1     Robert     89
2       Alen     99
3      Smith     87
4  Katharine     90
5       Liam     83
6   J Martin     82

In [11]:
#all the rows, start from Name to all column
df.loc[:,'Name':]

        Name  Marks Grades
0       Jame     98     AA
1     Robert     89     AB
2       Alen     99     AA
3      Smith     87     AB
4  Katharine     90     AC
5       Liam     83     BA
6   J Martin     82     BB

## iloc

In [14]:
#all the rows of Name and Marks column
df.iloc[:,0:2]

        Name  Marks
0       Jame     98
1     Robert     89
2       Alen     99
3      Smith     87
4  Katharine     90
5       Liam     83
6   J Martin     82

In [15]:
import pandas as pd
dict={'Name':['Jame','Robert','Alen','Smith','Katharine','Liam','J Martin'], 
     'Marks':[98,89,99,87,90,83,82], 
     'Grades':['AA','AB','AA','AB','AC','BA','BB']}
df=pd.DataFrame(dict,index=['stu1','stu2','sut3','stu4','stu5','sut6','stu7'])
df

           Name  Marks Grades
stu1       Jame     98     AA
stu2     Robert     89     AB
sut3       Alen     99     AA
stu4      Smith     87     AB
stu5  Katharine     90     AC
sut6       Liam     83     BA
stu7   J Martin     82     BB

In [ ]:
#loc
#Name, Marks, and Grades of stu1 and stu2

In [19]:
df.loc[['stu1','stu2'],:]

        Name  Marks Grades
stu1    Jame     98     AA
stu2  Robert     89     AB

In [23]:
#loc
#Name of stu1 to stu4
df.loc['stu1':'stu4','Name']

stu1      Jame
stu2    Robert
sut3      Alen
stu4     Smith
Name: Name, dtype: object

In [32]:
df.loc[['stu1','stu2','sut3','stu4'],'Name']

stu1      Jame
stu2    Robert
sut3      Alen
stu4     Smith
Name: Name, dtype: object

In [25]:
#iloc
#Name, Makrs of stu1 and stu2
df.iloc[[0,1],[0,1]]

        Name  Marks
stu1    Jame     98
stu2  Robert     89

In [26]:
df.iloc[0:2,0:2]

        Name  Marks
stu1    Jame     98
stu2  Robert     89

In [27]:
#iloc
#Name, Marks and Grades of stu1, stu2 and stu3
df.iloc[0:3,:]

        Name  Marks Grades
stu1    Jame     98     AA
stu2  Robert     89     AB
sut3    Alen     99     AA

In [28]:
df.iloc[[0,1,2],[0,1,2]]

        Name  Marks Grades
stu1    Jame     98     AA
stu2  Robert     89     AB
sut3    Alen     99     AA

# iat

### Access a single value for a row/column pair by integer position.
### Similar to iloc, in that both provide integer-based lookups.
### Using 'iat' if you only need to get or set single value in a DataFrame or Series.

In [34]:
import pandas as pd

dict={'Name':['King','Queen','Pricess','Prince','Diana','William','Georg'],
      'Marks':[90,89,80,88,90,98,88],
      'Grades':['AA','AB','CC','BB','AA','AA','BB']}
df=pd.DataFrame(dict,index=['stu1','stu2','stu3','stu4','stu5','stu6','stu7'])
df

         Name  Marks Grades
stu1     King     90     AA
stu2    Queen     89     AB
stu3  Pricess     80     CC
stu4   Prince     88     BB
stu5    Diana     90     AA
stu6  William     98     AA
stu7    Georg     88     BB

### iat

In [36]:
#value at stu1 row of Name col
df.iat[0,0]

'King'

In [37]:
#print Grade of stu2
df.iat[1,2]

'AB'

In [38]:
#print Name of stu5
df.iat[4,0]

'Diana'

In [40]:
#set Marks of stu5 to 99
df.iat[4,1]=99
df

         Name  Marks Grades
stu1     King     90     AA
stu2    Queen     89     AB
stu3  Pricess     80     CC
stu4   Prince     88     BB
stu5    Diana     99     AA
stu6  William     98     AA
stu7    Georg     88     BB

# at

### Access a single value for a row/column label pair.
### Similar to loc, in that both provide label-based lookups.
### Using 'at' if you only need to get or set single value in a DataFrame or Series.

In [42]:
#print Grade of stu2
df.at['stu2','Grades']

'AB'

In [43]:
#print name of stu5
df.at['stu5','Name']

'Diana'

In [55]:
import pandas as pd

dict={'Name':['King','Queen','Pricess','Prince','Diana','William','Georg'],
      'Marks':[90,89,80,88,90,98,88],
      'Grades':['AA','AB','CC','BB','AA','AA','BB']}
df=pd.DataFrame(dict,index=['stu1','stu2','stu3','stu4','stu5','stu6','stu7'])
df

         Name  Marks Grades
stu1     King     90     AA
stu2    Queen     89     AB
stu3  Pricess     80     CC
stu4   Prince     88     BB
stu5    Diana     90     AA
stu6  William     98     AA
stu7    Georg     88     BB

In [57]:
df.at['stu7','Marks']=99
df

         Name  Marks Grades
stu1     King     90     AA
stu2    Queen     89     AB
stu3  Pricess     80     CC
stu4   Prince     88     BB
stu5    Diana     90     AA
stu6  William     98     AA
stu7    Georg     99     BB